/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   go_left.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: napark <napark@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/16 02:49:08 by napark            #+#    #+#             */
/*   Updated: 2021/06/16 02:56:52 by napark           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "include/push_swap.h"

void     go_left(int *buffer_a, int buf_a_size)
{
    int i;

    i = 0;
    while (i < buf_a_size)//'\0'까지임으로 이 전까지
    {
        buffer_a[i] = buffer_a[i+1];//마지막은 '\0'유지
        i++;
    }
}